src/InformationRegisters/ПараметрыКластеров/ПараметрыКластеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыКластеров</name>
  <resources>
    <name>ТипПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресСервераАдминистрирования</name>
    <comment>// Только для &quot;RAS&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортСервераАдминистрирования</name>
    <comment>// Только для &quot;RAS&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогЗапускаСервераАдминистрирования</name>
    <comment>// Только для &quot;RAС&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортАгентаКластера</name>
    <comment>ПортАгентаСервера Только для &quot;COM&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КластерОбъектаКонтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортКластера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформы</types>
    </type>
  </resources>
  <resources>
    <name>ИмяКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПерезапускаРабочихПроцессов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимыйОбъемПамяти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалДопустимогоПревышенияОбъемаПамяти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоеОтклонениеОшибокСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПринудительноЗавершатьПроблемныеПроцессы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыключенныеПроцессыОстанавливатьЧерез</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньОтказоустойчивости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РежимРаспределенияНагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мониторинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВидыОбъектовКонтроля</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОценкаПроизводительностиКлючевыеОперации/ОценкаПроизводительностиКлючевыеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкаПроизводительностиКлючевыеОперации</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦелевоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальноДопустимыйУровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПриоритетВИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦелевоеВремяВИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВыполненаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПомеченаНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ОбщийСерверПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

Функция НастройкиКластер1С(Ссылка, ВерсияДанных, ВерсияДанныхПодключение) Экспорт
    
    Настройки = РегистрыСведений.ПараметрыКластеров.ПрочитатьНастройки(Ссылка);
    АктивноеПодключение = Справочники.ПараметрыПодключенияКластер1С.АктивноеПодключение(Ссылка.Подключение);
    Настройки.Вставить("АктивноеПодключение", АктивноеПодключение);
    
    Возврат Настройки;
    
КонецФункции

Функция НастройкиКонтрольПотребленияПамяти(Ссылка, ВерсияДанных) Экспорт
    Возврат РегистрыСведений.НастройкиКонтрольПамяти.ПрочитатьНастройки(Ссылка);
КонецФункции

Функция КонтрольПотребленияПамяти(СсылкаОбъектКонтроля, ВерсияДанных) Экспорт
    Возврат Справочники.КонтрольныеПроцедуры.ПолучитьКонтрольнуюПроцедуруПоОбъектуКонтроля(СсылкаОбъектКонтроля, Справочники.ВидыКонтрольныхПроцедур.КонтрольПотребленияПамяти());
КонецФункции

Функция ПолучитьПараметрыЗаписиПроизводительности(ИмяКлючевойОперации, ЦелевоеВремя) Экспорт
    
    ОбъектКонтроля = Справочники.ОбъектыКонтроля.ПолучитьСсылкуПоНаименованию("Центр контроля качества");
	УникальныйИдентификаторКлючевойОперацииСтруктура = РегистрыСведений.ОценкаПроизводительностиКлючевыеОперации.ПолучитьУникальныйИдентификаторКлючевойОперации(ИмяКлючевойОперации, ОбъектКонтроля, ЦелевоеВремя, Истина);
	ПользовательЗамераПроизводительности = ПолучитьПользователяЗамераПроизводительности();	
	
	ПараметрыЗаписиПроизводительности = Новый Структура();
	ПараметрыЗаписиПроизводительности.Вставить("ОбъектКонтроля", ОбъектКонтроля);
	ПараметрыЗаписиПроизводительности.Вставить("УникальныйИдентификаторКлючевойОперации", УникальныйИдентификаторКлючевойОперацииСтруктура.УникальныйИдентификатор);
    ПараметрыЗаписиПроизводительности.Вставить("ПомеченаНаУдаление", УникальныйИдентификаторКлючевойОперацииСтруктура.ПомеченаНаУдаление);
	ПараметрыЗаписиПроизводительности.Вставить("ПользовательЗамераПроизводительности", ПользовательЗамераПроизводительности);	
		
	Возврат ПараметрыЗаписиПроизводительности;
    
КонецФункции

Функция ПолучитьПользователяЗамераПроизводительности(ИмяТекПользователя = Неопределено) Экспорт
    
    Если ИмяТекПользователя = Неопределено Тогда
	    ИмяТекПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
    КонецЕсли;
    
	Ссылка = Справочники.ПользователиЗамерПроизводительности.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ИмяТекПользователя) Тогда
		Ссылка = ПользовательЗамерПроизводительностиПоНаименование(ИмяТекПользователя);
		
		Если Ссылка = Справочники.ПользователиЗамерПроизводительности.ПустаяСсылка() Тогда
			НачатьТранзакцию();
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировки = БлокировкаДанных.Добавить("Справочник.ПользователиЗамерПроизводительности");
			ЭлементБлокировки.УстановитьЗначение("Наименование", ИмяТекПользователя);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Попытка
				БлокировкаДанных.Заблокировать();
				
				Ссылка = ПользовательЗамерПроизводительностиПоНаименование(ИмяТекПользователя);
				Если Ссылка = Справочники.ПользователиЗамерПроизводительности.ПустаяСсылка() Тогда
					ОбъектДляЗаписи = Справочники.ПользователиЗамерПроизводительности.СоздатьЭлемент();
					ОбъектДляЗаписи.Наименование = ИмяТекПользователя;
					ОбъектДляЗаписи.Записать();
					Ссылка = ОбъектДляЗаписи.Ссылка;
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ВызватьИсключение(ИнформацияОбОшибке());
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ссылка;
    
КонецФункции

Функция ИдентификаторЦКК() Экспорт
	Возврат Общий.ИдентификаторЦКК();
КонецФункции

Функция ПолучитьПараметрЗамераПоНаименованию(Наименование) Экспорт
	Возврат Справочники.ПараметрыЗамера.СсылкаПоНаименованию(Наименование);
КонецФункции

Функция ПолучитьЗначениеПараметраЗамераПоНаименованию(Наименование, ПараметрЗамера) Экспорт
	Возврат Справочники.ЗначенияПараметраЗамера.СсылкаПоНаименованию(Наименование, ПараметрЗамера)
КонецФункции

Функция ПолучитьПользователяЗамераПроизводительностиПоНаименованию(Наименование, СоздаватьНового) Экспорт
	Возврат Справочники.ПользователиЗамерПроизводительности.ПолучитьСсылкуПоНаименованию(Наименование, СоздаватьНового);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПользовательЗамерПроизводительностиПоНаименование(Наименование)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Справочник.ПользователиЗамерПроизводительности
	|ГДЕ
	|	Наименование = &Наименование
	|";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Ссылка = Справочники.ПользователиЗамерПроизводительности.ПустаяСсылка();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Ссылка = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Ссылка;
КонецФункции

#КонецОбласти
